#include <reg52.h>
#include <intrins.h>
#define uint unsigned int
#define uchar unsigned char

long pulse_count = 0;   //外部脉冲计数 
uint t0_count = 0;	  //定时器 t0 中断计数，用于1s计时 
long freq_temp = 0;	  //频率计数暂存值	

/*--------------------------------------------------------------*/
/*                     LCD函数部分 								×/
/*--------------------------------------------------------------*/
//LCD接口定义					
sfr		 io	= 0x80;				//P0-0x80,P1-0x90,P2-0xA0,P3-0xB0;
sbit	 rs = P2^6;				//LCD数据/命令选择端(H/L)
sbit	 rw = P2^5;				//LCD读/写选择端(H/L)
sbit	 ep = P2^7;				//LCD使能控制
sbit     bz = io^7;				//LCD忙标志位

/*--------------------------------------------------------------*/
//函数声明		
void lcd_busy(void);					//测试LCD忙碌状态程序
void lcd_wcmd(uchar cmd);		//写入指令到LCD程序
void lcd_wdat(uchar dat);		//写入数据到LCD程序
void lcd_pos (uchar x, bit y);	//LCD数据指针位置程序
void lcd_init(void);					//LCD初始化设定程序

/*--------------------------------------------------------------*/
//测试LCD忙碌状态
void lcd_busy(void){	
	do{
		ep = 0;
		rs = 0;		//指令
		rw = 1;		//读出
		io = 0xff;
		ep = 1;
		_nop_();	//高电平读出	1us	
	}while(bz);		//bz=1表示忙,bz=0表示空闲
	ep = 0;		
}

/*--------------------------------------------------------------*/
//写入指令到LCD
void lcd_wcmd(uchar cmd){							
	lcd_busy();	//检测忙
	rs = 0;		//指令
	rw = 0;		//写入
	ep = 1;	
	io = cmd;	//指令
	ep = 0;		//下降沿有效	
}

/*--------------------------------------------------------------*/
//LCD数据指针位置程序
void lcd_pos(uchar x, bit y){						
	if(y)lcd_wcmd(x|0xc0);	//y=1,第二行显示;y=0,第一行显示		0<=x<16
	else lcd_wcmd(x|0x80);	//数据指针=80+地址码(00H~27H,40H~67H)
}

/*--------------------------------------------------------------*/
//写入数据函数
void lcd_wdat(unsigned char Data){
	lcd_busy();  //检测忙
	rs = 1;		 //数据
	rw = 0;		 //写入
	ep = 1;
	io = Data;	 //数据
	ep = 0;		 //下降沿有效
}

/*--------------------------------------------------------------*/
//显示字符串
void prints(uchar *string){
	while(*string) {lcd_wdat(*string);string++;}
}

/*--------------------------------------------------------------*/
//LCD初始化设定
void lcd_init(){						
	lcd_wcmd(0x38);		//设置LCD为16X2显示,5X7点阵,八位数据接口
	lcd_wcmd(0x06);		//LCD显示光标移动设置(光标地址指针加1,整屏显示不移动)
	lcd_wcmd(0x0c);		//LCD开显示及光标设置(光标不闪烁,不显示"_")
	lcd_wcmd(0x01);		//清除LCD的显示内容
}
/*--------------------------------------------------------------*/
/*					中断函数部分								*/
/*--------------------------------------------------------------*/
// 定时器中断t0初始化函数
void t0_init(){
	TMOD |= 0x01;		//定时器0工作模式为 MODEL 1,timer 
	TH0 = 0xFC;
	TL0 = 0x18;
	ET0 = 1;			//定时器0中断使能	
	IP = 0x02;			//设定定时器0中断优先级最高 
	TR0 = 1;			//定时器启动 
}

/*--------------------------------------------------------------*/
// 外部中断int0初始化函数
void int0_init(){
	EX0 = 1;			//外部中断使能
	IT0 = 1;			//外部中断0采用边沿触发 
}
 
/*--------------------------------------------------------------*/
//内部定时器t0中断函数
void t0_int() interrupt 1{
	TH0 = 0xFC;
	TL0 = 0x18;
	EA = 0;				//暂时关闭总中断 	
	t0_count++;
	if(t0_count==1000){
		freq_temp = pulse_count;  //频率值等于脉冲计数值 
		t0_count = 0;				//定时器中断计数清零	
		pulse_count = 0;			//脉冲计数清零 
	}
	else freq_temp = 0;
	EA = 1;	 					//开总中断 
}

/*--------------------------------------------------------------*/
//外部中断0中断函数
void int0_int() interrupt 0{
	pulse_count++; 
} 

/*--------------------------------------------------------------*/
//频率计数函数
long get_freq(){		   	
	t0_init();
	int0_init();
	while(freq_temp==0);		//等待定时器计时到达 1s
	return freq_temp;
}

/*--------------------------------------------------------------*/
/*					程序主体									*/
/*--------------------------------------------------------------*/
//数字转字符函数
void display(long x){
	uchar freqchar[8];
	freqchar[6] = x%10+'0';
	freqchar[5] = (x/10)%10 + '0';
	freqchar[4] = (x/100)%10 + '0';
	freqchar[3] = (x/1000)%10 + '0';
	freqchar[2] = (x/10000)%10 + '0';
	freqchar[1] = (x/100000)%10 + '0';
	freqchar[0] = (x/1000000)%10 + '0';
	freqchar[7] = '\0';
   	lcd_pos(0,1);
	prints(freqchar);	
}

/*--------------------------------------------------------------*/
//主函数
void main(){
	long freq = 0;
	EA = 1;					//开总中断 
	lcd_init();
	lcd_pos(0,0); 
	prints("Frequency is:");
	lcd_pos(8,1);
	prints("Hz");
	while(1){
	freq = get_freq();		//得到频率值
	display(freq);			//调用LCD显示函数
	}
}

/*--------------------------------------------------------------*/
